examples/general/example_passing_contact_details.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:fi:tulli:wsdl_root.002" xmlns:urn1="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:urn2="urn:iso:std:iso:20022:tech:xsd:auth.001.001.01" xmlns:urn3="urn:fin.012.001.03">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:ApplicationRequest id="applicationRequest">
            <urn1:AppHdr>
                <urn1:CharSet>UTF-8</urn1:CharSet>
                <urn1:Fr>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>0245442-8</urn1:Id>
                                    <urn1:SchmeNm>
                                        <urn1:Cd>Y</urn1:Cd>
                                    </urn1:SchmeNm>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                        <urn1:CtctDtls>
                            <urn1:Nm>Virkailijan nimi</urn1:Nm>
                            <urn1:PhneNb>Virkailijan puhelinnumero</urn1:PhneNb>
                            <urn1:EmailAdr>Virkailijan sähköpostiosoite<urn1:EmailAdr>
                        </urn1:CtctDtls>
                    </urn1:OrgId>
                </urn1:Fr>
                <urn1:To>...
                </urn1:To>
                <urn1:BizMsgIdr>MAdsAvAdRLq0W3bfyf2efQ==</urn1:BizMsgIdr>
                <urn1:MsgDefIdr>auth.001.001.01</urn1:MsgDefIdr>
                <urn1:CreDt>2022-11-29T15:00:00Z</urn1:CreDt>
                <urn1:Sgntr>...
                </urn1:Sgntr>
            </urn1:AppHdr>
            <urn2:Document>
                <urn2:InfReqOpng>
                    ...
                </urn2:InfReqOpng>
            </urn2:Document>
        </urn:ApplicationRequest>
    </soapenv:Body>
</soapenv:Envelope>